src/testsuite_old/sysbench/results/oltp_delete.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 724.08 qps: 724.08 (r/w/o: 0.00/708.15/15.93) lat (ms,95%): 272.27 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 693.75 qps: 693.75 (r/w/o: 0.00/656.50/37.25) lat (ms,95%): 257.95 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 571.90 qps: 571.90 (r/w/o: 0.00/526.80/45.10) lat (ms,95%): 434.83 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           38141
        other:                           2084
        total:                           40225
    transactions:                        40225  (669.02 per sec.)
    queries:                             40225  (669.02 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      669.0182
    time elapsed:                        60.1271s
    total number of events:              40225

Latency (ms):
         min:                                   58.19
         avg:                                  191.75
         max:                                  990.41
         95th percentile:                      308.84
         sum:                              7713049.52

Threads fairness:
    events (avg/stddev):           314.2578/2.88
    execution time (avg/stddev):   60.2582/0.02

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 662.52 qps: 662.52 (r/w/o: 0.00/591.89/70.62) lat (ms,95%): 363.18 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 531.95 qps: 531.95 (r/w/o: 0.00/460.35/71.60) lat (ms,95%): 646.19 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 392.75 qps: 392.75 (r/w/o: 0.00/334.60/58.15) lat (ms,95%): 787.74 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           27860
        other:                           4107
        total:                           31967
    transactions:                        31967  (530.50 per sec.)
    queries:                             31967  (530.50 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      530.5028
    time elapsed:                        60.2595s
    total number of events:              31967

Latency (ms):
         min:                                   26.33
         avg:                                  241.51
         max:                                 1280.63
         95th percentile:                      694.45
         sum:                              7720432.94

Threads fairness:
    events (avg/stddev):           249.7422/2.33
    execution time (avg/stddev):   60.3159/0.01